{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.18.0", "signature": {"inputs": {"keras_tensor_56": {"name": "keras_tensor_56:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/Cast_1/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/convolution/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16384"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "keras_tensor_56", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/mul", "op": "Mul", "input": ["keras_tensor_56", "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/sequential_1_1/rescaling_1_1/mul", "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/Cast_1/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/rescaling_1_1/add", "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/Reshape"], "device": "/device:CPU:0", "attr": {"leakyrelu_alpha": {"f": 0.2}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "padding": {"s": "U0FNRQ=="}, "filter_format": {"s": "SFdJTw=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/max_pooling2d_3_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/conv2d_3_1/add"], "attr": {"explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/max_pooling2d_3_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/conv2d_3_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/Reshape"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_host_args": {"i": "0"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "filter_format": {"s": "SFdJTw=="}, "leakyrelu_alpha": {"f": 0.2}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/sequential_1_1/max_pooling2d_4_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/conv2d_4_1/add"], "attr": {"data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/max_pooling2d_4_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/add", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1_1/conv2d_4_1/Relu", "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/Reshape"], "device": "/device:CPU:0", "attr": {"data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "filter_format": {"s": "SFdJTw=="}, "num_host_args": {"i": "0"}, "use_cudnn_on_gpu": {"b": true}, "epsilon": {"f": 0.0}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "StatefulPartitionedCall/sequential_1_1/max_pooling2d_5_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1_1/conv2d_5_1/add"], "attr": {"ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "VkFMSUQ="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "explicit_paddings": {"list": {}}}}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/sequential_1_1/max_pooling2d_5_1/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1_1/conv2d_5_1/Relu", "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape", "StatefulPartitionedCall/sequential_1_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_2_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1_1/dense_2_1/Relu", "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "transpose_b": {"b": false}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1_1/dense_3_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/Cast/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/rescaling_1_1/Cast_1/x", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/convolution/ReadVariableOp", "shape": [3, 3, 3, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_3_1/Reshape", "shape": [1, 1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/convolution/ReadVariableOp", "shape": [3, 3, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_4_1/Reshape", "shape": [1, 1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/convolution/ReadVariableOp", "shape": [3, 3, 32, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/conv2d_5_1/Reshape", "shape": [1, 1, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/flatten_1_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Cast/ReadVariableOp", "shape": [16384, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_2_1/Add/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Cast/ReadVariableOp", "shape": [128, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1_1/dense_3_1/Add/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}